package ua.com.glybovets.java1_1.lecture10;

import acm.program.ConsoleProgram;
import acm.util.RandomGenerator;
import ua.com.glybovets.java1_1.lecture7.P71FactRecurce;
import ua.com.glybovets.java1_1.lecture9.MyCounter;
	
	/*	Написати клас, що буде містити наступні методи:
1. метод, що 10 разів виводить на екран ім'я й прізвище.
2. метод, що виводить таблицю квадратів перших десяти цілих позитивних чисел.
3. метод, що виводить таблицю квадратів перших п'яти цілих позитивних непарних чисел.
4. метод, що обчислює суму перших n цілих позитивних цілих чисел. Кількість сумуємих чисел повинна вводитися під час роботи програми.
5. метод, що обчислює суму перших n членів ряду 1, 3, 5, 7, .... Кількість сумуємих чисел повинна вводитися під час роботи програми.
6. метод, що обчислює суму перших n членів ряду 1+1/2+1/3+1/4+...
7. метод, що виводить таблицю ступенів двійки (від нульової до десятої).
8. метод, що обчислює факторіал уведеного із клавіатури числа.
9. метод, що виводить таблицю значень функції y = -2,4х2+5х-3 у діапазоні від -2 до 2 із кроком 0,5.
10. метод, що генерує 10 випадкових чисел у діапазоні від 1 до 10, виводить ці числа на екран й обчислює їх середнє арифметичне.
11. метод, що виводить на екран таблицю вартості, наприклад, яблук у діапазоні від 100 гм. до 1 кг із кроком 100.
12. метод перевірки вміння складати й віднімати числа в межах 100. Програма повинна вивести 10 прикладів, причому в кожному прикладі зменшуване повинне бути більше або дорівнює що віднімає, тобто не допускається пропонувати випробуваному приклади з негативним результатом. Оцінка виставляється за наступним правилом: за 10 правильних відповідей - "відмінно", за 9 й 8 -"добре", за 7 й 6 - "задовільно", за 6 і менш - "погано".
13. метод, що обчислює суму й середнє арифметичне послідовності позитивних чисел, які вводяться із клавіатури.
14. метод, що визначає максимальне число з уведеної із клавіатури послідовності позитивних чисел (довжина послідовності не обмежена).
15. метод, що перевіряє, чи є ціле число, уведене користувачем, простим.
16. метод, що "задумує" число в діапазоні від 1 до 100 і пропонує користувачеві вгадати число за 7 спроб. На кожному кроці комп'ютер повідомляє "більше" або "менше" загадане ним число відносно введеного користувачем.
	 */

public class P10_1_16 extends ConsoleProgram{
	
	public void run() {
		int i;
		
		println("1. метод, що 10 разів виводить на екран ім'я й прізвище");
		String namesoname = readLine("Введыть Ваше ім'я й прізвище: ");
		printName10Times(namesoname);
		
		println("2. метод, що виводить таблицю квадратів перших десяти цілих позитивних чисел");
		readLine("Натисніть Enter, коли будете готові ");
		kvadratFist10Num();
		
		println("3. метод, що виводить таблицю квадратів перших п'яти цілих позитивних непарних чисел");
		readLine("Натисніть Enter, коли будете готові ");
		kvadratFirst5UnpairNum();
		
		println("4. метод, що обчислює суму перших n цілих позитивних цілих чисел." +
				"Кількість сумуємих чисел повинна вводитися під час роботи програми");
		int n4=readInt("Введіть число n: ");
		println("Cумма перших n чисел: "+sumFirstN(n4));
		
		println("5. метод, що обчислює суму перших n членів ряду 1, 3, 5, 7, .... " +
				"Кількість сумуємих чисел повинна вводитися під час роботи програми");
		int n5=readInt("Введіть число n: ");
		println("Cумма перших n чисел ряду 1, 3, 5, 7..: "+sumFirstNUnpair(n5));
		
		println("6. метод, що обчислює суму перших n членів ряду 1+1/2+1/3+1/4+...");
		double n6=readInt("Введіть число n: ");
		println("Cумма перших n чисел ряду 1+1/2+1/3+1/4+...: "+sumFirstNDrob(n6));

		println("7. метод, що виводить таблицю ступенів двійки (від нульової до десятої)");
		readLine("Натисніть Enter, коли будете готові ");
		for (i=0; i<=10;i++)
			println("2("+i+")="+tabOf2Step(i));
		
		println("8. метод, що обчислює факторіал уведеного із клавіатури числа");
		long n8=readInt("Введіть число n: ");
		println(n8+"!="+factorial(n8));
		
		println("9. метод, що виводить таблицю значень функції y = -2,4х2+5х-3 у діапазоні від -2 до 2 із кроком 0,5");
		readLine("Натисніть Enter, коли будете готові ");
		double x9=-2;
		i=0;
		while (x9>=(-2)&&x9<=2) {
			println("y("+x9+")="+(-2.4*x9*x9+5*x9-3));
			i++;
			x9+=0.5;
		}
		
		println("10. метод, що генерує 10 випадкових чисел у діапазоні від 1 до 10," +
				" виводить ці числа на екран й обчислює їх середнє арифметичне.");
		readLine("Натисніть Enter, коли будете готові ");
		random10Avr();
		
		println("11. метод, що виводить на екран таблицю вартості, " +
				"наприклад, яблук у діапазоні від 100 гм. до 1 кг із кроком 100.");
		String tov=readLine("Ввведіть назву товару ");
		double price=readDouble("та варьість 1 кг ");
		println("-----------------");
		println(tov);		
		for (i=1; i<10;i++)
			println("Вартість "+100*i+" гр - "+(price*i/(10)));
		println("Вартість 1 кг - "+price);
		
		println("12. метод перевірки вміння складати й віднімати числа в межах 100." +
				" Програма повинна вивести 10 прикладів, " +
				"причому в кожному прикладі зменшуване повинне бути більше або дорівнює що віднімає," +
				" тобто не допускається пропонувати випробуваному приклади з негативним результатом." +
				" Оцінка виставляється за наступним правилом: за 10 правильних відповідей - відмінно, " +
						"за 9 й 8 - добре, за 7 й 6 - задовільно, за 6 і менш - погано.");
		println("Введіть правильну відповідь");
		plusMinusTest();
		
		println("13. метод, що обчислює суму й середнє арифметичне послідовності позитивних чисел, які вводяться із клавіатури.");
		int n13=-1;
		int i13=0;
		int sum13=0;
		while (n13!=0) {
			n13=readInt("Введіть число більше 0 або 0 для виходу: ");
			if (n13==0)
				break;
			else{
				sum13+=n13;
				i13++;
			}
		}
		println ("Сумма введених чисел - "+sum13);
		println ("Середнє значення введених чисел - "+(sum13/i13));
	
		
		println ("14. метод, що визначає максимальне число " +
				"з уведеної із клавіатури послідовності позитивних чисел " +
				"(довжина послідовності не обмежена)");
		int n14=1;
		int max14=0;
		while (n14!=0) {
			n14=readInt("Введіть число більше 0 або 0 для виходу: ");
			if (n14==0)
				break;
			else if (n14>=max14)
					max14=n14;
		}
		println ("Максимальне з введених чисел: "+max14);

		println ("15. метод, що перевіряє, чи є ціле число, уведене користувачем, простим.");
		int n15=readInt("Введіть число n: ");
		int i15=2;
		while (i15<n15){
			if (n15%i15==0){
				println("Число n не просте");
				break;
			}
			i15++;
			if (i15==n15)
				println("Ви ввели просте число");
		}
		
		
		println ("16. метод, що задумує число в діапазоні від 1 до 100" +
				" і пропонує користувачеві вгадати число за 7 спроб." +
				" На кожному кроці комп'ютер повідомляє більше або менше загадане ним число відносно введеного користувачем.");
		guesNumber();
	}
	
	private void guesNumber() {
			int numUser=0; //Число, що буде загадувати користувач
			int	num16 = rgen.nextInt(1, 100); 
			int counter=0;
			
			println("Компютер загадав число в діапазоні від 1 до 100");
			println("Спробуйте вгадати його за 7 спроб");
			
			numUser = readInt("Вкажіть ваш варіант числа. Спроба 1: ");
			if (numUser==num16)
				println("Ви вгадали з першого разу!!!");
			else {
				for (counter=2;counter<9;counter++) {
					if (counter==7){
						println("Ви вичерпали кількість спроб, але не вгадали число");
						break;
					}
						
					if (numUser<num16) 
						println("Загадане число быльше");
					if (numUser>num16) 
						println("Загадане число менше");
										
					numUser = readInt("Вкажіть ваш варіант числа. Спроба "+counter+": ");
					
					if (numUser==num16){ 
						println("Ви вгадали. Кількість спроб - " + counter);
						break;
					}
				}
				
			}
	}

	private void plusMinusTest() {
		int res;	
		int ans;
		int count=0;
		for (int i = 1; i <= 10; i++) {
			int ri = rgen.nextInt(1,100);
			int rj = rgen.nextInt(1,100-ri);
			if (ri<rj){
				res=ri+rj;
				ans=readInt(ri+" + "+rj+" = ");
			} else{
				res=ri-rj;
				ans=readInt(ri+" - "+rj+" = ");
			}
			if (res==ans)
				count++;
		}
		if (count==10)
			println("Ваш результат - Відмінно!!");
		else if (count==9 || count==8)
			println("Ваш результат - Добре");
		else if (count==7 || count==6)
			println("Ваш результат - Задовільно");
		else 
			println("спробуй повторити правила додавання й віднімання чмсел");
	}

	private void random10Avr() {
		int avr=0;
		for (int i = 1; i <= 10; i++) {
			int ri = rgen.nextInt(1,100);
			println ("Випадкове число"+i+ " - "+ri);
			avr=(avr*(i-1)+ri)/i;
		}
		println ("Середнє значення цихвипадкових числе - "+avr);
	}
	
	/* Private instance variables */
	private RandomGenerator rgen = RandomGenerator.getInstance();
	

	private long factorial(long n8) {
		if (n8<=1)
			return 1;
		return n8*factorial(n8-1);
	}

	private int tabOf2Step(int n7){
			if (n7==0)
				return 1;
			else
				return 2*tabOf2Step(n7-1);
	}

	private double sumFirstNDrob(double n6) {
		if (n6==0)
			return 0;
		return (1/n6)+sumFirstNDrob(n6-1);
	}

	private int sumFirstNUnpair(int n5) {
		if (n5==1)
			return 1;
		return (2*n5-1)+sumFirstNUnpair(n5-1); 
	}

	public int sumFirstN(int n) {
		if (n==1)
			return 1;
		return n+sumFirstN(n-1);
	}

	private void kvadratFirst5UnpairNum() {
		int n=1;
		int i=1;
		while (i<=5) {
			if (n%2==1){
				println(n+" в квадраті "+(n*n));
				i++;
			}
			n++;
		}	
	}

	private void kvadratFist10Num() {
		for (int i = 1; i <=10; i++) {
			println(i+" в квадраті "+(i*i));
		}		
	}

	private void printName10Times(String namesoname) {
		for (int i = 0; i < 10; i++) {
			println((i+1)+". "+namesoname);
		}		
	}

	
}
